#define _CRT_SECURE_NO_WARNINGS 1
//下面开始写一些简单的数据类型分别可以存储什么数据
int main()
{//----------------------------------------------------
	//字符类型
	char a = 'A'; // 存储单个字符
	//整形
	int age = 20; // 存储整数
	//浮点型
	float height = 5.9; // 存储小数
	//双精度浮点型
	double pi = 3.14159; // 存储更精确的小数
//-----------------------------------------------------
	//如果需要打印整数的话按照以下格式
	printf("%d\n,520");
	//需要打印大小的话可以加上关键字"sizeof"
	// sizeof的单位是1字节（byte）
	printf("%d\n",sizeof(int));
//------------------------------------------------------
	//定义变量的方法
	int age = 19; // 定义一个整型变量age并赋值为19
	age = age + 1; // 将变量age的值加1，可通过"printf"查看是否改变
	float weight = 65.5; // 定义一个浮点型变量weight并赋值为65.5
	char ch = 'A'; // 定义一个字符变量ch并赋值为'A'
	//--------------------------------------------------
	//两个变量求和的方法
	int a = 10;// 定义并初始化变量a
	int b = 20;// 定义并初始化变量b
	int sum = 0;// 定义变量sum用于存储和
	scanf("%d %d", &a, &b);// 输入并读取两个整数并存储到变量a和b中
	sum = a + b;// 计算a和b的和并存储到变量sum中
	printf("%d\n", sum);// 输出变量sum的值
	return 0;
}